package com.example.interfaces;

public interface CuttingDevice {
    public void cut();
}
/*
1) різні модифікатори доступу (public, private,..) класів/методів/полів (1 бал) Питання по цій статті: https://javarush.ru/quests/lectures/questcore.level05.lecture01
2) присутня інкапсуляція (1 бал)
3) присутнє наслідування (1 бал)
4) присутній інтерфейс і його імплементація (1 бал)
5) присутній поліморфізм (1 бал) Прочитати https://javarush.ru/quests/lectures/questcore.level02.lecture01
6) присутній абстрактний клас (1 бал)
7) використовується перераховування константних об’єктів (enum) (1 бал)
8) Перевизначити метод toString() для класу enum. Наприклад, виводити всі значення у одну строчку розділяючи комою.
Додати до перерахування власний метод.
Використати обидва методи у програмі.
Вміти обґрунтувати необхідність методу саме в цьому класі (1 бал)
Вміти переробити enum клас так, щоб конструктор вміщував на 1 більше елемент. (завдання під час перевірки лабораторної). Прочитати https://vertex-academy.com/tutorials/ru/perechisleniya-enum-v-java-chast-3/
--------- Робота зі строками-------
9) Зібрати строку за допомогою StringBuffer або StringBuilder, вміти пояснити, чому так більш влучно, ніж за допомогою оператора "+" для String. Прочитати https://javarush.ru/groups/posts/2351-znakomstvo-so-string-stringbuffer-i-stringbuilder-v-java (1 бал)
10) Використати метод String.split(...) для розділення строки за критерієм обраного символу. Перед виконанням прочитати https://www.baeldung.com/string/split (1 бал)
11) Вивести деякі строки на екран консолі із використанням конкатенції строк із іншими типами (1 бал)
--------- Робота з виключеннями-------
12) Створити клас-виключення для обробки специфічної для вашої тематики помилки. (1 бал)
Знати ієрархію виключень та могти пояснити різницю між RuntimeException, Exception, Error. Знати приклади перерахованих видів виключень. Вміти пояснити, де яку треба використовувати.
13) Кидати вами створену помилку та інші за необхідності, обробляти їх у влучному місці за допомогою блоку try-catch-finally (1 бал)
Могти пояснити, в яких випадках потрібно перераховувати помилку в специфікації методу.
Знати відповідь на питання "Чи викличеться finally, якщо викликати вихід з програми у верхній частині блоку.
--------- Робота з equals & hashCode -------
14) Використати неперевизначений метод equals або hashCode для порівняння двох об’єктів одного з ваших класів. (1 бал)
15) Перевизначити метод equals або hashCode у одному з ваших класів, використати перевизначений метод для перевірки об’єктів цього класу. (1 бал)
Знати, який метод викликається першим для порівняння об'єктів. Чи може бути достатньо викликати hashCode(), щоб однозначно стверджувати, що об'єкти різні чи однакові?
--------- Робота з OOП та вкладеними класами -------
16) наявний вкладений (nested) клас (1 бал)
17) присутня асоціація класів (1 бал)
18) присутня композиція або агрегація (без урахування nested класу) (1 бал)
--------- Робота з колекціями -------
19) присутня колекція із java.util.Collections, тип — такий, що найбільше підходить для завдання на вашу думку. Створити об’єкт-ітератор і реалізувати перебір за його допомогою створеної колекції (2 бали).
Могти розказати ієрархію колекцій, обгрунтувати свій вибір колекції, пояснити різницю між LinkedList & ArrayList, розказати структуру Map & Set
 */